МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_Тесты/ТС_Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТС_Тесты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТС_Курсы</owners>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устаревший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.ТС_Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьОтветы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подтверждение</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаПодтверждение</name>
      <type>
        <types>DocumentRef.ТС_РезультатТестирования</types>
        <types>CatalogRef.ТС_Файлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Documents/ТС_РезультатТестирования/ТС_РезультатТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТС_РезультатТестирования</name>
  <registerRecords>InformationRegister.ТС_РезультатыТестирований</registerRecords>
  <attributes>
    <name>НомерТестирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборТестов</name>
    <type>
      <types>CatalogRef.ТС_НаборыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ТС_Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ТС_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тесты</name>
    <attributes>
      <name>Тест</name>
      <type>
        <types>CatalogRef.ТС_Тесты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_Тесты/ManagerModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьПодтверждения(Тест) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	//Проверим значение параметра
	Если ТипЗнч(Тест) <> Тип("СправочникСсылка.ТС_Тесты") Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;	
	
	МакетПодтверждения = ПолучитьМакет("МакетПодтверждения");
	
	//Шапка
	Область = МакетПодтверждения.ПолучитьОбласть("Шапка");
	Область.Параметры.Курс = Тест.Владелец;
	Область.Параметры.Тест = Тест;	
	ТабличныйДокумент.Вывести(Область);
	
	//Шапка подтверждения
	ОбластьПодтверждение = МакетПодтверждения.ПолучитьОбласть("Подтверждение");
	ОбластьСсылка = МакетПодтверждения.ПолучитьОбласть("ПодтверждениеСсылка");
	ОбластьКартинка = МакетПодтверждения.ПолучитьОбласть("ПодтверждениеКартинка");
	ОбластьТекст = МакетПодтверждения.ПолучитьОбласть("ПодтверждениеТекст");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС_ТестыПодтверждение.НомерСтроки КАК НомерПодтверждения,
	|	ТС_ТестыПодтверждение.Описание,
	|	ТС_ТестыПодтверждение.СсылкаПодтверждение КАК Подтвеждение,
	|	ВЫБОР
	|		КОГДА ТС_ТестыПодтверждение.СсылкаПодтверждение ССЫЛКА Документ.ТС_РезультатТестирования
	|			ТОГДА 1
	|		КОГДА ТС_ТестыПодтверждение.СсылкаПодтверждение ССЫЛКА Справочник.ТС_Файлы
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ТипПодтверждения
	|ИЗ
	|	Справочник.ТС_Тесты.Подтверждение КАК ТС_ТестыПодтверждение
	|ГДЕ
	|	ТС_ТестыПодтверждение.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТС_ТестыПодтверждение.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Тест);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьПодтверждение.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабличныйДокумент.Вывести(ОбластьПодтверждение);
		Если ВыборкаДетальныеЗаписи.ТипПодтверждения = 1 Тогда
			ОбластьСсылка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьСсылка);
		ИначеЕсли ВыборкаДетальныеЗаписи.ТипПодтверждения = 2 Тогда
			Картинка = Новый Картинка(ВыборкаДетальныеЗаписи.Подтвеждение.Изображение.Получить());
			ОбластьКартинка.Рисунки.Изображение.Картинка = Картинка;
			ТабличныйДокумент.Вывести(ОбластьКартинка);
		Иначе
			ОбластьТекст.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьТекст);
		КонецЕсли;			
		
	КонецЦикла;

	Возврат ТабличныйДокумент;	
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти
